MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/PIC24EP256GU814/hal_ll_pps_connection_defs.h
    {GPIO_PIN_4, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 52, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD0_RP64
    {GPIO_PIN_0, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 64, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD1_RP65
    {GPIO_PIN_1, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 65, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD10_RPI74
    {GPIO_PIN_10, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 74, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD11_RPI75
    {GPIO_PIN_11, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 75, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD12_RPI76
    {GPIO_PIN_12, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 76, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD13_RPI77
    {GPIO_PIN_13, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 77, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD14_RPI78
    {GPIO_PIN_14, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 78, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD15_RP79
    {GPIO_PIN_15, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 79, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD2_RP66
    {GPIO_PIN_2, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 66, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD3_RP67
    {GPIO_PIN_3, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 67, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD4_RP68
    {GPIO_PIN_4, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 68, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD5_RP69
    {GPIO_PIN_5, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 69, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD6_RP70
    {GPIO_PIN_6, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 70, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD7_RP71
    {GPIO_PIN_7, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 71, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD8_RPI72
    {GPIO_PIN_8, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 72, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RD9_RPI73
    {GPIO_PIN_9, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 73, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE0_RP80
    {GPIO_PIN_0, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 80, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE1_RPI81
    {GPIO_PIN_1, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 81, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE2_RP82
    {GPIO_PIN_2, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 82, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE3_RPI83
    {GPIO_PIN_3, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 83, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE4_RP84
    {GPIO_PIN_4, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 84, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE5_RP85
    {GPIO_PIN_5, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 85, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE6_RPI86
    {GPIO_PIN_6, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 86, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE7_RP87
    {GPIO_PIN_7, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 87, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE8_RPI88
    {GPIO_PIN_8, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 88, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RE9_RPI89
    {GPIO_PIN_9, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 89, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF0_RP96
    {GPIO_PIN_0, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 96, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF1_RP97
    {GPIO_PIN_1, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 97, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF12_RP108
    {GPIO_PIN_12, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 108, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF13_RP109
    {GPIO_PIN_13, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 109, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF2_RP98
    {GPIO_PIN_2, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 98, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF3_RP99
    {GPIO_PIN_3, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 99, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF4_RP100
    {GPIO_PIN_4, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 100, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF5_RP101
    {GPIO_PIN_5, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 101, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RF8_RP104
    {GPIO_PIN_8, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 104, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG0_RP112
    {GPIO_PIN_0, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 112, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG1_RP113
    {GPIO_PIN_1, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 113, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG12_RPI124
    {GPIO_PIN_12, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 124, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG13_RP125
    {GPIO_PIN_13, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 125, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG14_RP126
    {GPIO_PIN_14, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 126, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG15_RP127
    {GPIO_PIN_15, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 127, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG6_RP118
    {GPIO_PIN_6, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 118, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG7_RPI119
    {GPIO_PIN_7, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 119, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG8_RP120
    {GPIO_PIN_8, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 120, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI1_MISO_RG9_RPI121
    {GPIO_PIN_9, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 121, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR20_REG_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA0_RPI16
    // {GPIO_PIN_0, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 16, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA1_RPI17
    // {GPIO_PIN_1, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 17, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA14_RPI30
    // {GPIO_PIN_14, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 30, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA15_RPI31
    // {GPIO_PIN_15, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 31, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA2_RPI18
    // {GPIO_PIN_2, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 18, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA3_RPI19
    // {GPIO_PIN_3, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 19, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA4_RPI20
    // {GPIO_PIN_4, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 20, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA5_RPI21
    // {GPIO_PIN_5, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 21, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA6_RPI22
    // {GPIO_PIN_6, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 22, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RA7_RPI23
    // {GPIO_PIN_7, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 23, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB0_RPI32
    // {GPIO_PIN_0, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 32, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB1_RPI33
    // {GPIO_PIN_1, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 33, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB10_RPI42
    // {GPIO_PIN_10, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 42, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB11_RPI43
    // {GPIO_PIN_11, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 43, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB12_RPI44
    // {GPIO_PIN_12, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 44, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB13_RPI45
    // {GPIO_PIN_13, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 45, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB14_RPI46
    // {GPIO_PIN_14, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 46, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB15_RPI47
    // {GPIO_PIN_15, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 47, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB2_RPI34
    // {GPIO_PIN_2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 34, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB3_RPI35
    // {GPIO_PIN_3, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 35, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB4_RPI36
    // {GPIO_PIN_4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 36, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB5_RPI37
    // {GPIO_PIN_5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 37, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB6_RPI38
    // {GPIO_PIN_6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 38, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB7_RPI39
    // {GPIO_PIN_7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 39, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB8_RPI40
    // {GPIO_PIN_8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 40, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RB9_RPI41
    // {GPIO_PIN_9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 41, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC1_RPI49
    // {GPIO_PIN_1, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 49, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC12_RPI60
    // {GPIO_PIN_12, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 60, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC13_RPI61
    // {GPIO_PIN_13, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 61, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC14_RPI62
    // {GPIO_PIN_14, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 62, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC2_RPI50
    // {GPIO_PIN_2, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 50, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC3_RPI51
    // {GPIO_PIN_3, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 51, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RC4_RPI52
    // {GPIO_PIN_4, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 52, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD0_RP64
    // {GPIO_PIN_0, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 64, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD1_RP65
    // {GPIO_PIN_1, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 65, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD10_RPI74
    // {GPIO_PIN_10, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 74, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD11_RPI75
    // {GPIO_PIN_11, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 75, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD12_RPI76
    // {GPIO_PIN_12, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 76, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD13_RPI77
    // {GPIO_PIN_13, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 77, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD14_RPI78
    // {GPIO_PIN_14, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 78, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD15_RP79
    // {GPIO_PIN_15, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 79, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD2_RP66
    // {GPIO_PIN_2, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 66, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD3_RP67
    // {GPIO_PIN_3, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 67, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD4_RP68
    // {GPIO_PIN_4, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 68, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD5_RP69
    // {GPIO_PIN_5, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 69, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD6_RP70
    // {GPIO_PIN_6, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 70, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD7_RP71
    // {GPIO_PIN_7, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 71, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD8_RPI72
    // {GPIO_PIN_8, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 72, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RD9_RPI73
    // {GPIO_PIN_9, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 73, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE0_RP80
    // {GPIO_PIN_0, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 80, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE1_RPI81
    // {GPIO_PIN_1, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 81, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE2_RP82
    // {GPIO_PIN_2, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 82, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE3_RPI83
    // {GPIO_PIN_3, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 83, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE4_RP84
    // {GPIO_PIN_4, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 84, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE5_RP85
    // {GPIO_PIN_5, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 85, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE6_RPI86
    // {GPIO_PIN_6, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 86, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE7_RP87
    // {GPIO_PIN_7, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 87, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE8_RPI88
    // {GPIO_PIN_8, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 88, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RE9_RPI89
    // {GPIO_PIN_9, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 89, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF0_RP96
    // {GPIO_PIN_0, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 96, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF1_RP97
    // {GPIO_PIN_1, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 97, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF12_RP108
    // {GPIO_PIN_12, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 108, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF13_RP109
    // {GPIO_PIN_13, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 109, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF2_RP98
    // {GPIO_PIN_2, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 98, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF3_RP99
    // {GPIO_PIN_3, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 99, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF4_RP100
    // {GPIO_PIN_4, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 100, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF5_RP101
    // {GPIO_PIN_5, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 101, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RF8_RP104
    // {GPIO_PIN_8, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 104, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG0_RP112
    // {GPIO_PIN_0, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 112, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG1_RP113
    // {GPIO_PIN_1, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 113, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG12_RPI124
    // {GPIO_PIN_12, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 124, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG13_RP125
    // {GPIO_PIN_13, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 125, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG14_RP126
    // {GPIO_PIN_14, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 126, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG15_RP127
    // {GPIO_PIN_15, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 127, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG6_RP118
    // {GPIO_PIN_6, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 118, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG7_RPI119
    // {GPIO_PIN_7, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 119, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG8_RP120
    // {GPIO_PIN_8, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 120, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI2_MISO_RG9_RPI121
    // {GPIO_PIN_9, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 121, HAL_LL_PPS_MODULE_INDEX_2, INVALID_PPS_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RA0_RPI16
    {GPIO_PIN_0, GPIO_PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 16, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
