MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/PIC24EP256GU814/hal_ll_pps_connection_defs.h
    {GPIO_PIN_7, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 71, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD8_RPI72
    {GPIO_PIN_8, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 72, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD9_RPI73
    {GPIO_PIN_9, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 73, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE0_RP80
    {GPIO_PIN_0, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 80, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE1_RPI81
    {GPIO_PIN_1, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 81, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE2_RP82
    {GPIO_PIN_2, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 82, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE3_RPI83
    {GPIO_PIN_3, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 83, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE4_RP84
    {GPIO_PIN_4, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 84, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE5_RP85
    {GPIO_PIN_5, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 85, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE6_RPI86
    {GPIO_PIN_6, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 86, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE7_RP87
    {GPIO_PIN_7, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 87, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE8_RPI88
    {GPIO_PIN_8, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 88, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE9_RPI89
    {GPIO_PIN_9, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 89, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF0_RP96
    {GPIO_PIN_0, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 96, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF1_RP97
    {GPIO_PIN_1, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 97, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF12_RP108
    {GPIO_PIN_12, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 108, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF13_RP109
    {GPIO_PIN_13, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 109, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF2_RP98
    {GPIO_PIN_2, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 98, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF3_RP99
    {GPIO_PIN_3, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 99, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF4_RP100
    {GPIO_PIN_4, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 100, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF5_RP101
    {GPIO_PIN_5, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 101, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF8_RP104
    {GPIO_PIN_8, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 104, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG0_RP112
    {GPIO_PIN_0, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 112, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG1_RP113
    {GPIO_PIN_1, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 113, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG12_RPI124
    {GPIO_PIN_12, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 124, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG13_RP125
    {GPIO_PIN_13, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 125, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG14_RP126
    {GPIO_PIN_14, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 126, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG15_RP127
    {GPIO_PIN_15, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 127, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG6_RP118
    {GPIO_PIN_6, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 118, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG7_RPI119
    {GPIO_PIN_7, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 119, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG8_RP120
    {GPIO_PIN_8, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 120, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG9_RPI121
    {GPIO_PIN_9, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 121, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif

    { HAL_LL_PIN_NC, HAL_LL_PORT_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_MODULE_ERROR }
};

